#數字運算

#x=3*6
#print(x)

#除法分成整數除法與小數除法
#小數除法: 除完會顯示小數
# x=3/6
# print(x)

#整數除法: 除完只顯示整數位
#用法: // 
# x=7//6
# print(x)

#取餘數
#x=7%6
#print(x)

#次方用法: **
#x=7**2
#print(x)

#開更號用0.5
#x=49**0.5
#print(x)

# x=2+3
# print(x)
# x+=1    #x=x+1  #等號後面要先看，將變數中的數字+1)
# print(x)

#x-=1    #x=x-1  
#print(x)

#x*=2    #x=x*2  
#print(x)

#----------------------------------------------------------

#字串運算
#s="Messi"   #用雙引號跟單引號都可以
#print(s)

# s="Mess\"i"   #在雙引號內想顯示引號 " ，可用\跳脫
# print(s)

# s="Messi"+"10"   #字串加接，也可以用空白作串接
# print(s)

# s="Messi\n10"   #雙引號內想換行可輸入\n
# print(s)

# s="""Messi
# 10"""   #在外面用三個雙引號或三個單引號也可以換行
# print(s)

# s="""Messi
# 123
# 10"""   #可以再裡面任意換行，會顯示換行數，裡面也可以打很多行的字
# print(s)

# s="Messi"*3+"10"   # *數字，可以連續顯示相同字串
# print(s)

#字串會對內部的字元編號(索引)，從 0 開始算起
s="Messi"   
print(s[2])

s="Messi"   
print(s[1:4])   #顯示開頭不包含結尾

s="Messi"   
print(s[1:])   #顯示位置1算起到結尾

s="Messi"   
print(s[:4])   #顯示開頭算起到4(不包含4)